miniwinwm/miniwinwm/Renesas/RX65N/MiniWinFile/src/smc_gen/r_usb_basic/src/driver/r_usb_usbif_api.c
/******************************************************************************
Function Name   : R_USB_Open
Description     : Start of USB Driver.
Arguments       : usb_ctrl_t    *p_ctrl : Pointer to usb_ctrl_t structure
                : usb_cfg_t     *cfg    : Pointer to usb_cfg_t structure
Return value    : usb_err_t error code  : USB_SUCCESS,USB_ERR_NG etc.
******************************************************************************/
usb_err_t R_USB_Open( usb_ctrl_t *ctrl, usb_cfg_t *cfg )
{
    usb_err_t   err;
#if (BSP_CFG_RTOS_USED == 1)
    usb_err_t   os_err;
#endif /* (BSP_CFG_RTOS_USED == 1) */

#if ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST )
    usb_utr_t   utr;

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */

#if USB_CFG_PARAM_CHECKING == USB_CFG_ENABLE
    /* Argument Checking */
    if ((USB_IP0 != ctrl->module) && (USB_IP1 != ctrl->module))
    {
        return USB_ERR_PARA;
    }

    if ((( USB_HS != cfg->usb_speed ) && ( USB_FS != cfg->usb_speed )) && ( USB_LS != cfg->usb_speed )
            && (USB_HOST != cfg->usb_mode))
    {
        return USB_ERR_PARA;
    }

#if defined(BSP_MCU_RX65N) || defined(BSP_MCU_RX630) || defined(BSP_MCU_RX63T)
    if (USB_IP1 == ctrl->module)
    {
        return USB_ERR_PARA;
    }
#endif /* #if defined(BSP_MCU_RX65N) || defined(BSP_MCU_RX630) || defined(BSP_MCU_RX63T) */

#if defined(BSP_MCU_RX63N)
    if ((USB_IP1 == ctrl->module) && (USB_HOST == cfg->usb_mode))
    {
        return USB_ERR_PARA;
    }
#endif /* #if defined(BSP_MCU_RX63N) */

    switch (ctrl->type)
    {
        case USB_PCDC:
        case USB_PCDCC:
        case USB_PHID:
        case USB_PVND:
        case USB_PMSC:
            if (USB_PERI != cfg->usb_mode)
            {
                return USB_ERR_PARA;
            }
            if ( (USB_LS == cfg->usb_speed) || (USB_NULL == cfg->p_usb_reg) )
            {
                return USB_ERR_PARA;
            }
#if defined(BSP_MCU_RX71M)
#if USB_IP0 == USB_CFG_USE_USBIP
            if (USB_HS == cfg->usb_speed)
            {
                return USB_ERR_PARA;
            }
#endif  /* USB_IP1 == USB_CFG_USE_USBIP */
#else   /* defined(BSP_MCU_RX71M) */
            if ( USB_HS == cfg->usb_speed )
            {
                return USB_ERR_PARA;
            }
#endif  /* defined(BSP_MCU_RX71M) */
        break;

        /* Host */
        case USB_HCDC:
        case USB_HCDCC:
        case USB_HHID:
        case USB_HVND:
        case USB_HMSC:
#if defined(BSP_MCU_RX630)
            return USB_ERR_PARA;
#else  /* defined(BSP_MCU_RX630) */
            if (USB_HOST != cfg->usb_mode)
            {
                return USB_ERR_PARA;
            }
#if defined(BSP_MCU_RX71M)
            if ((USB_HS == cfg->usb_speed) && (USB_IP1 != ctrl->module))
            {
                return USB_ERR_PARA;
            }
#else  /* defined(BSP_MCU_RX71M) */
            if ( USB_HS == cfg->usb_speed )
            {
                return USB_ERR_PARA;
            }
#endif /* defined(BSP_MCU_RX71M) */
#endif  /* defined(BSP_MCU_RX630) */
        break;

        default:
            return USB_ERR_PARA;
        break;
    }
#endif /* USB_CFG_PARAM_CHECKING == USB_CFG_ENABLE */

#if (BSP_CFG_RTOS_USED == 1)
    os_err = usb_cstd_get_semaphore(ctrl);
    if (USB_SUCCESS != os_err)
    {
        return USB_ERR_NG;
    }
#endif /* (BSP_CFG_RTOS_USED == 1) */

    if (USB_YES == is_init[ctrl->module])
    {
#if (BSP_CFG_RTOS_USED == 1)
        usb_cstd_rel_semaphore(ctrl);
#endif /* (BSP_CFG_RTOS_USED == 1) */
        return USB_ERR_BUSY;
    }

    memset((void *)&g_usb_cstd_event, 0, sizeof(g_usb_cstd_event));
    is_init[ctrl->module] = USB_YES;

    g_usb_open_class[ctrl->module]      = 0;
#if (BSP_CFG_RTOS_USED == 1)
    g_usb_cur_task_hdl[ctrl->module]    = (usb_hdl_t)USB_NULL;
#endif  /* (BSP_CFG_RTOS_USED == 1) */

    g_usb_change_device_state[ctrl->module] = 0;
    memset((void *)&g_usb_read_request_size[ctrl->module], 0, ((USB_MAXPIPE_NUM+1)*4));

#if ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST )
    g_usb_hstd_use_pipe[ctrl->module] = 0;
    memset((void *)&g_usb_hdata[ctrl->module], 0, sizeof(usb_utr_t));
#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */

#if ( (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI )
    memset((void *)&g_usb_pdata, 0, ((USB_MAXPIPE_NUM+1) * sizeof(usb_utr_t)));
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */

    if (USB_HOST == cfg->usb_mode)
    {
#if ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST )
        g_usb_usbmode = USB_HOST;

        utr.ip  = ctrl->module;
        utr.ipp = usb_hstd_get_usb_ip_adr( (uint8_t)ctrl->module  );    /* Get the USB IP base address. */

        err = usb_module_start( (uint8_t)utr.ip );
        if (USB_SUCCESS == err)
        {
            /* USB driver initialization */
            usb_hdriver_init( &utr, cfg );

            /* Setting MCU(USB interrupt init) register */
            usb_cpu_usbint_init((uint8_t)utr.ip);

            /* Setting USB relation register  */
            hw_usb_hmodule_init(ctrl); /* MCU */

#if defined(USB_CFG_HHID_USE)
            if (USB_HHID == ctrl->type)
            {
                hw_usb_hset_trnensel(&utr);
            }
#endif  /* defined(USB_CFG_HHID_USE) */

            usb_hstd_vbus_control(&utr, (uint16_t)USB_VBON);
#if USB_CFG_BC == USB_CFG_DISABLE
            usb_cpu_delay_xms((uint16_t)100);    /* 100ms wait */

#endif /*  USB_CFG_BC == USB_CFG_DISABLE */
        }

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }
    else
    {
#if ( (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI )
        g_usb_usbmode = USB_PERI;

        /* USB module start setting */
        err = usb_module_start(USB_CFG_USE_USBIP);
        if (USB_SUCCESS == err)
        {
            /* USB driver initialization */
            usb_pdriver_init( ctrl, cfg );

            /* Setting MCU(USB interrupt init) register */
            usb_cpu_usbint_init(USB_CFG_USE_USBIP);

            /* Setting USB relation register  */
            hw_usb_pmodule_init();

#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
            if (USB_HS == cfg->usb_speed)
            {
                hw_usb_set_hse(USB_NULL);
            }
#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */
            if ( USB_ATTACH == usb_pstd_chk_vbsts() )
            {
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
                hw_usb_set_cnen();
#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */
                usb_cpu_delay_xms((uint16_t)10);
                hw_usb_pset_dprpu();
            }
        }
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }

    if (USB_SUCCESS == err)
    {
        g_usb_open_class[ctrl->module] |= (1 << ctrl->type);      /* Set USB Open device class */
        if (USB_PCDC == ctrl->type)
        {
            g_usb_open_class[ctrl->module] |= (1 << USB_PCDCC);   /* Set USB Open device class */
        }
        if (USB_HCDC == ctrl->type)
        {
            g_usb_open_class[ctrl->module] |= (1 << USB_HCDCC);   /* Set USB Open device class */
        }
    }

#if (BSP_CFG_RTOS_USED == 1)
    usb_cstd_rel_semaphore(ctrl);
#endif /* (BSP_CFG_RTOS_USED == 1) */

