miniwinwm/miniwinwm/Renesas/RX65N/MiniWinFile/src/smc_gen/r_usb_basic/src/driver/r_usb_usbif_api.c
    return USB_ERR_NG;
}
/******************************************************************************
 End of function R_USB_Stop
 ******************************************************************************/

/******************************************************************************
Function Name   : R_USB_Suspend
Description     : USB Suspend process for USB Host.
Arguments       : usb_ctrl_t    *p_ctrl : Pointer to usb_ctrl_t structure
Return value    : usb_err_t error code  : USB_SUCCESS,USB_ERR_NG etc.
******************************************************************************/
usb_err_t    R_USB_Suspend(usb_ctrl_t *p_ctrl)
{
    usb_err_t   ret_code = USB_SUCCESS;
#if ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST )
#if (BSP_CFG_RTOS_USED == 1)
    usb_err_t   os_err;
#endif /* (BSP_CFG_RTOS_USED == 1) */

    usb_utr_t   utr;
    usb_info_t  info;
    usb_er_t    err;
#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */

#if USB_CFG_PARAM_CHECKING == USB_CFG_ENABLE
    if (USB_PERI == g_usb_usbmode)
    {
        return USB_ERR_NG;              /* Support Host only. */
    }

    /* Argument Checking */
    if ((USB_IP0 != p_ctrl->module) && (USB_IP1 != p_ctrl->module))
    {
        return USB_ERR_PARA;
    }

#if defined(BSP_MCU_RX65N) || defined(BSP_MCU_RX630) || defined(BSP_MCU_RX63T)
    if (USB_IP1 == p_ctrl->module)
    {
        return USB_ERR_PARA;
    }
#endif

#if defined(BSP_MCU_RX63N)
    if ((USB_IP1 == p_ctrl->module) && (USB_HOST == g_usb_usbmode))
    {
        return USB_ERR_PARA;
    }
#endif

#endif  /* USB_CFG_PARAM_CHECKING == USB_CFG_ENABLE */

#if ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST )

#if USB_CFG_PARAM_CHECKING == USB_CFG_ENABLE

    if (USB_NULL == p_ctrl)
    {
        return USB_ERR_PARA;
    }

    p_ctrl->address = USB_DEVICEADDR;

#endif  /* USB_CFG_PARAM_CHECKING == USB_CFG_ENABLE */

#if (BSP_CFG_RTOS_USED == 1)
        os_err = usb_cstd_get_semaphore(p_ctrl);
        if (USB_SUCCESS != os_err)
        {
            return USB_ERR_NG;
        }
#endif /* (BSP_CFG_RTOS_USED == 1) */

    ret_code = R_USB_GetInformation(p_ctrl, &info);
    if (USB_STS_CONFIGURED != info.status)
    {
#if (BSP_CFG_RTOS_USED == 1)
        usb_cstd_rel_semaphore(p_ctrl);
#endif /* (BSP_CFG_RTOS_USED == 1) */
        return USB_ERR_NG;
    }

    if (USB_STS_CONFIGURED == info.status)
    {
        utr.ip = p_ctrl->module;
        utr.ipp = usb_hstd_get_usb_ip_adr(utr.ip);

        if (USB_NULL != (g_usb_change_device_state[p_ctrl->module] & (1 << USB_STS_SUSPEND)))
        {
#if (BSP_CFG_RTOS_USED == 1)
            usb_cstd_rel_semaphore(p_ctrl);
#endif /* (BSP_CFG_RTOS_USED == 1) */
            return USB_ERR_BUSY;
        }

        err = usb_hstd_change_device_state(&utr, (usb_cb_t)&usb_hstd_suspend_complete,
                                           USB_DO_GLOBAL_SUSPEND, p_ctrl->address);
        if (USB_OK == err)
        {
            g_usb_change_device_state[p_ctrl->module] |= (1 << USB_STS_SUSPEND);
        }
        else
        {
#if (BSP_CFG_RTOS_USED == 1)
            usb_cstd_rel_semaphore(p_ctrl);
#endif /* (BSP_CFG_RTOS_USED == 1) */
            ret_code = USB_ERR_NG;
        }
    }
    else if (USB_STS_SUSPEND == info.status)
    {
#if (BSP_CFG_RTOS_USED == 1)
        usb_cstd_rel_semaphore(p_ctrl);
#endif /* (BSP_CFG_RTOS_USED == 1) */
        return USB_ERR_BUSY;
    }
    else
    {
#if (BSP_CFG_RTOS_USED == 1)
        usb_cstd_rel_semaphore(p_ctrl);
#endif /* (BSP_CFG_RTOS_USED == 1) */
        return USB_ERR_NG;
    }

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */

    return ret_code;
}
/******************************************************************************
 End of function R_USB_Suspend
 ******************************************************************************/

/******************************************************************************
Function Name   : R_USB_Resume
Description     : USB Resume process(Host) and Remote wakeup process(Peri).
Arguments       : usb_ctrl_t    *p_ctrl : Pointer to usb_ctrl_t structure
Return value    : usb_err_t error code  : USB_SUCCESS,USB_ERR_NG etc.
******************************************************************************/
usb_err_t    R_USB_Resume(usb_ctrl_t *p_ctrl)
{
#if ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST )
    usb_utr_t   utr;
    usb_er_t    err;
#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    usb_err_t   ret_code = USB_SUCCESS;
    usb_info_t  info;
#if (BSP_CFG_RTOS_USED == 1)
    usb_err_t   os_err;
#endif /* (BSP_CFG_RTOS_USED == 1) */

#if USB_CFG_PARAM_CHECKING == USB_CFG_ENABLE
    if (USB_NULL == p_ctrl)
    {
        return USB_ERR_PARA;
    }

    /* Argument Checking */
    if ((USB_IP0 != p_ctrl->module) && (USB_IP1 != p_ctrl->module) && ( USB_HOST == g_usb_usbmode))
    {
        return USB_ERR_PARA;
    }

#if defined(BSP_MCU_RX65N) || defined(BSP_MCU_RX630) || defined(BSP_MCU_RX63T)
    if (USB_IP1 == p_ctrl->module)
    {
        return USB_ERR_PARA;
    }
#endif

#if defined(BSP_MCU_RX63N)
    if ((USB_IP1 == p_ctrl->module) && (USB_HOST == g_usb_usbmode))
    {
        return USB_ERR_PARA;
    }
#endif

    if (USB_HOST == g_usb_usbmode)
    {
        p_ctrl->address = USB_DEVICEADDR;
    }
    else
    {
        if (USB_PHID != p_ctrl->type)
        {
            return USB_ERR_PARA;
        }
    }

#endif  /* USB_CFG_PARAM_CHECKING == USB_CFG_ENABLE */

#if (BSP_CFG_RTOS_USED == 1)
    os_err = usb_cstd_get_semaphore(p_ctrl);
    if (USB_SUCCESS != os_err)
    {
        return USB_ERR_NG;
    }
#endif /* (BSP_CFG_RTOS_USED == 1) */

    ret_code = R_USB_GetInformation(p_ctrl, &info);
    if (USB_SUCCESS != ret_code)
    {
#if (BSP_CFG_RTOS_USED == 1)
        usb_cstd_rel_semaphore(p_ctrl);
#endif /* (BSP_CFG_RTOS_USED == 1) */
        return USB_ERR_NG;
    }

    if (USB_STS_SUSPEND != info.status)
    {
#if (BSP_CFG_RTOS_USED == 1)
        usb_cstd_rel_semaphore(p_ctrl);
#endif /* (BSP_CFG_RTOS_USED == 1) */
        return USB_ERR_NOT_SUSPEND;
    }

    if (USB_HOST == g_usb_usbmode)
    {
#if ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST )
        utr.ip = p_ctrl->module;
        utr.ipp = usb_hstd_get_usb_ip_adr(utr.ip);

        if (USB_NULL != (g_usb_change_device_state[p_ctrl->module] & (1 << USB_STS_RESUME)))
        {
#if (BSP_CFG_RTOS_USED == 1)
            usb_cstd_rel_semaphore(p_ctrl);
#endif /* (BSP_CFG_RTOS_USED == 1) */
            return USB_ERR_BUSY;
        }

