miniwinwm/miniwinwm/Renesas/RX65N/MiniWinFile/src/smc_gen/r_usb_basic/src/driver/r_usb_usbif_api.c
#if defined(BSP_MCU_RX63N) || defined(BSP_MCU_RX65N) || defined(BSP_MCU_RX630) || defined(BSP_MCU_RX63T)
    if ((USB_IP1 == p_ctrl->module) && (USB_HOST == g_usb_usbmode))
    {
        return USB_ERR_PARA;
    }
#endif /* #if defined(BSP_MCU_RX63N)   || defined(BSP_MCU_RX65N) || */

    if (((USB_NULL == p_ctrl) || (USB_NULL == buf) || (USB_PIPE0 == p_ctrl->pipe)) || (USB_MAXPIPE_NUM < p_ctrl->pipe))
    {
        return USB_ERR_PARA;
    }

#if ( (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI )
    if (USB_PERI == g_usb_usbmode)
    {
        if ((USB_NULL == buf) && (USB_NULL != size))
        {
            return USB_ERR_PARA;
        }
    }
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI */



    if (USB_NULL == (g_usb_open_class[p_ctrl->module] & (1 << p_ctrl->type)))      /* Check USB Open device class */
    {
        return USB_ERR_PARA;
    }

#endif  /* USB_CFG_PARAM_CHECKING == USB_CFG_ENABLE */

#if (BSP_CFG_RTOS_USED == 1)
    os_err = usb_cstd_get_semaphore(p_ctrl);
    if (USB_SUCCESS != os_err)
    {
        return USB_ERR_NG;
    }
#endif /* (BSP_CFG_RTOS_USED == 1) */

    if (USB_HOST == g_usb_usbmode)
    {
#if ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST )
        g_usb_hdata[p_ctrl->module][p_ctrl->pipe].ip = p_ctrl->module;
        g_usb_hdata[p_ctrl->module][p_ctrl->pipe].ipp = usb_hstd_get_usb_ip_adr(g_usb_hdata[p_ctrl->module][p_ctrl->pipe].ip);

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }

    ret_code = R_USB_GetInformation(p_ctrl, &info);
    if (USB_STS_CONFIGURED != info.status)
    {
#if (BSP_CFG_RTOS_USED == 1)
        usb_cstd_rel_semaphore(p_ctrl);
#endif /* (BSP_CFG_RTOS_USED == 1) */
        return USB_ERR_NG;
    }

    /* PIPE Transfer set */
    if (USB_HOST == g_usb_usbmode)
    {
#if ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST )
        g_usb_hdata[p_ctrl->module][p_ctrl->pipe].keyword     = p_ctrl->pipe;             /* Pipe No */
        g_usb_hdata[p_ctrl->module][p_ctrl->pipe].p_tranadr     = buf;                      /* Data address */
        g_usb_hdata[p_ctrl->module][p_ctrl->pipe].tranlen     = size;                     /* Data Size */
        g_usb_hdata[p_ctrl->module][p_ctrl->pipe].p_setup       = 0;
#if defined(USB_CFG_HVND_USE)
        g_usb_hdata[p_ctrl->module][p_ctrl->pipe].complete    = usb_hvendor_write_complete;  /* Callback function */
#endif /* defined(USB_CFG_HVND_USE) */
        g_usb_hdata[p_ctrl->module][p_ctrl->pipe].segment     = USB_TRAN_END;
        *(uint32_t *)g_usb_hdata[p_ctrl->module][p_ctrl->pipe].p_usr_data = p_ctrl->address;

        err = usb_hstd_transfer_start(&g_usb_hdata[p_ctrl->module][p_ctrl->pipe]);        /* USB Transfer Start */

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }
    else
    {
#if ( (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI )
        if (USB_NULL != g_p_usb_pstd_pipe[p_ctrl->pipe])
        {
#if (BSP_CFG_RTOS_USED == 1)
            usb_cstd_rel_semaphore(p_ctrl);
#endif /* (BSP_CFG_RTOS_USED == 1) */
            return USB_ERR_BUSY;
        }
        g_usb_pdata[p_ctrl->pipe].keyword    = p_ctrl->pipe;        /* Pipe No */
        g_usb_pdata[p_ctrl->pipe].p_tranadr    = buf;                 /* Data address */
        g_usb_pdata[p_ctrl->pipe].tranlen    = size;                /* Data Size */
#if defined(USB_CFG_PVND_USE)
        g_usb_pdata[p_ctrl->pipe].complete   = (usb_cb_t)&usb_pvnd_write_complete;  /* Callback function */
#endif  /* defined(USB_CFG_PCDC_USE) */

        err = usb_pstd_transfer_start(&g_usb_pdata[p_ctrl->pipe]);   /* USB Transfer Start */

#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI */
    }

    if (USB_OK == err)
    {
        ret_code = USB_SUCCESS;
    }
    else if (USB_QOVR == err)
    {
#if (BSP_CFG_RTOS_USED == 1)
        usb_cstd_rel_semaphore(p_ctrl);
#endif /* (BSP_CFG_RTOS_USED == 1) */
        ret_code = USB_ERR_BUSY;
    }
    else
    {
#if (BSP_CFG_RTOS_USED == 1)
        usb_cstd_rel_semaphore(p_ctrl);
#endif /* (BSP_CFG_RTOS_USED == 1) */
        ret_code = USB_ERR_NG;
    }
    return ret_code;
#endif /* #if !defined(USB_CFG_HVND_USE) && !defined(USB_CFG_PVND_USE) */

}
/******************************************************************************
 End of function R_USB_PipeWrite
 ******************************************************************************/

/******************************************************************************
Function Name   : R_USB_PipeStop
Description     : USB transfer stop process for Vendor class.
Arguments       : usb_ctrl_t    *p_ctrl : Pointer to usb_ctrl_t structure
Return value    : usb_err_t error code  : USB_SUCCESS,USB_ERR_NG etc.
******************************************************************************/
usb_err_t    R_USB_PipeStop(usb_ctrl_t *p_ctrl)
{
#if !defined(USB_CFG_HVND_USE) && !defined(USB_CFG_PVND_USE)
    return USB_ERR_NG;
#else
    
    usb_er_t    err;
    usb_err_t   ret_code = USB_ERR_NG;
    usb_info_t  info;

#if ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST )
    usb_utr_t   utr;

    if (USB_HOST == g_usb_usbmode)
    {
        utr.ip = p_ctrl->module;
        utr.ipp = usb_hstd_get_usb_ip_adr(utr.ip);
    }

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */

#if USB_CFG_PARAM_CHECKING == USB_CFG_ENABLE
    /* Argument Checking */
    if ((USB_IP0 != p_ctrl->module) && (USB_IP1 != p_ctrl->module) && ( USB_HOST == g_usb_usbmode))
    {
        return USB_ERR_PARA;
    }

#if defined(BSP_MCU_RX65N) || defined(BSP_MCU_RX630) || defined(BSP_MCU_RX63T)
    if (USB_IP1 == p_ctrl->module)
    {
        return USB_ERR_PARA;
    }
#endif

#if defined(BSP_MCU_RX63N)
    if ((USB_IP1 == p_ctrl->module) && (USB_HOST == g_usb_usbmode))
    {
        return USB_ERR_PARA;
    }
#endif

    if (((USB_NULL == p_ctrl) && (USB_HOST == g_usb_usbmode)) ||
            (USB_PIPE0 == p_ctrl->pipe) || (USB_MAXPIPE_NUM < p_ctrl->pipe))
    {
        return USB_ERR_PARA;
    }

    if (USB_NULL == (g_usb_open_class[p_ctrl->module] & (1 << p_ctrl->type)))      /* Check USB Open device class */
    {
        return USB_ERR_PARA;
    }

#endif  /* USB_CFG_PARAM_CHECKING == USB_CFG_ENABLE */

